
## Plan Result (terraform/aws/palserver)

[CI link](https://github.com/boxp/arch/actions/runs/8273973773)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_ecr_repository.palserver


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_repository.palserver must be replaced
-/+ resource "aws_ecr_repository" "palserver" {
      ~ arn                  = "arn:aws:ecr:ap-northeast-1:839695154978:repository/palserver" -> (known after apply)
      ~ id                   = "palserver" -> (known after apply)
        name                 = "palserver"
      ~ registry_id          = "839695154978" -> (known after apply)
      ~ repository_url       = "839695154978.dkr.ecr.ap-northeast-1.amazonaws.com/palserver" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ encryption_configuration {
          ~ kms_key         = "arn:aws:kms:ap-northeast-1:839695154978:key/a2bcaab0-22fe-484a-90c3-9941aaf47047" -> "a2bcaab0-22fe-484a-90c3-9941aaf47047" # forces replacement
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":74,"Program":"tfcmt","SHA1":"c965b507cfaf0ef8cf8f822035f7628488d0f577","Target":"terraform/aws/palserver","Vars":{},"WorkflowName":"pull_request_target"} -->